---
kind: method
id: M:Autodesk.Revit.DB.Lighting.PointLightShape.#ctor(Autodesk.Revit.DB.Lighting.PointLightShape)
source: html/3a8404ea-680d-8c1a-1618-fcaa0eeea515.htm
---
# Autodesk.Revit.DB.Lighting.PointLightShape.#ctor Method

Creates a copy of the given point light shape

## Syntax (C#)
```csharp
public PointLightShape(
	PointLightShape other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Lighting.PointLightShape`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null